/*Необхідно написати програму яка буде виводити інформацію за умовами при яких
число виводитиметься з правильним словом: 
"рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

Умови виконання ДЗ

Рік отримувати через prompt()
Зробити перевірку що користувач ввів число та це число не є від'ємним
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Створіть гілку js_homework2.
Додати туди ваше домашнє завдання
Вислати вашу гілку*/

let userAge = prompt('Скільки Вам років?');
let lastNumber = +userAge % 10;

/*if (+userAge < 0) {
    console.log('Число негативне. Будь ласка, введіть позитивне число');
}
if (+userAge === 0){
    console.log('Будь ласка, введіть число більше 0');
} 
if (+userAge > 0) {
    console.log('Число позитивне');
};*/

if (userAge <= 0) {
    console.log('Будь ласка, введіть число більше 0')
}

if (+lastNumber === 1 && userAge != 11) {
    console.log(userAge + ' ' + 'рік');
}
else if (+lastNumber > 1 && +lastNumber < 5 && userAge != 12 && userAge != 13 && userAge != 14) {
    console.log(userAge + ' ' + 'роки');
}
else {console.log(userAge + ' ' + 'років')}

/*else if (+lastNumber >= 5 && +lastNumber <= 9) {
    console.log(userAge + ' ' + 'років');
}*/
