/*
Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
*/

//Знаходжу числа які кратні трьом
let a = 100;
let b = 1;
while (b <= a) {
    if (b % 3 === 0)
    {
        console.log(b)
    }
    b++
}

// Хочу знайти тепер НЕ кратні трьом
let a = 100;
let b = 1;
while (b <= a) {
    if (b % 3 !== 0)
    {
        console.log(b)
    }
    b++
}

// Тепер хочу знайти їхню суму
let a = 100;
let b = 1;
let sum = 0;
    while (b <= a) {
        if (b % 3 !== 0)
        {
            sum += b;
        //console.log(sum)
        }
    b++;
}
console.log('Сума чисел від 1 до 100 включно, які не кратні 3-ом складає: ' + sum)